cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "sanemat/font"

brew "python3"
brew "macvim", args: ["with-override-system-vim"]
brew "fasd"
brew "ghq"
brew "git"
brew "jq"
brew "ricty"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "zsh"
brew "reattach-to-user-namespace"
brew "mas"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "jitouch"
cask "dropbox"
cask "shiftit"
cask "1password"
cask "clipy"
mas "Xcode", id: 497799835
