cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/cask-fonts"

brew "python3"
brew "macvim"
brew "fasd"
brew "ghq"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "jq"
brew "peco"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "zsh"
# brew "mas"
cask "bettertouchtool"
cask "google-chrome"
cask "firefox"
cask "font-source-code-pro"
cask "font-hackgen"
cask "google-japanese-ime"
cask "iterm2"
cask "1password"
cask "clipy"
cask "visual-studio-code"
# cask "emacs"
cask "karabiner-elements"
# mas "Xcode", id: 497799835
