cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/cask-fonts"

brew "asdf"
brew "ghq"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "jq"
brew "peco"
brew "ripgrep"
brew "tig"
brew "tmux"
# brew "mas"
cask "bettertouchtool"
cask "font-source-code-pro"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "google-japanese-ime"
cask "iterm2"
cask "1password"
cask "clipy"
cask "karabiner-elements"
cask "betterdisplay"
# mas "Xcode", id: 497799835
